# Costs Calculation

In [1]:
import pymysql.cursors
import numpy as np
import matplotlib.pyplot as plt
from pandas import DataFrame
from sqlalchemy import create_engine
import re
import operator

In [5]:
server = "localhost"
user = "student"
pwd = "student123"
db = "4iz562"

In [6]:
def query(sql):
    engine = create_engine('mysql+pymysql://'+user+':'+pwd+'@'+server+'/'+db)
    connection = engine.connect()
    result = connection.execute(sql)
    table = DataFrame(result.fetchall())
    table.columns = result.keys()
    connection.close()
    engine.dispose()
    return table

In [7]:
C = query("select CHAR_SEM_ACC, CHAR_SYN_ACC, CHAR_COM, CHAR_INT_CON, CHAR_EXT_CON from DQM_MDR")
C.head()

   CHAR_SEM_ACC  CHAR_SYN_ACC      CHAR_COM  CHAR_INT_CON  CHAR_EXT_CON
0  1.0000000000  1.0000000000  1.0000000000  1.0000000000  1.0000000000
1  1.0000000000  1.0000000000  1.0000000000  1.0000000000  1.0000000000
2  1.0000000000  1.0000000000  1.0000000000  1.0000000000  1.0000000000
3  1.0000000000  1.0000000000  1.0000000000  1.0000000000  1.0000000000
4  1.0000000000  1.0000000000  1.0000000000  1.0000000000  1.0000000000

In [8]:
X=C.fillna(0)

In [9]:
X['MIN_CHAR'] = X.min(axis=1)
X.head()

,CHAR_SEM_ACC,CHAR_SYN_ACC,CHAR_COM,CHAR_INT_CON,CHAR_EXT_CON,MIN_CHAR
0,1.0000000000,1.0000000000,1.0000000000,1.0000000000,1.0000000000,1.0
1,1.0000000000,1.0000000000,1.0000000000,1.0000000000,1.0000000000,1.0
2,1.0000000000,1.0000000000,1.0000000000,1.0000000000,1.0000000000,1.0
3,1.0000000000,1.0000000000,1.0000000000,1.0000000000,1.0000000000,1.0
4,1.0000000000,1.0000000000,1.0000000000,1.0000000000,1.0000000000,1.0

In [13]:
U = query("select U01, U02, U03, U04, U05, U06, U07, U08, U09, U10 from DQM_MDR")
U.head()

   U01  U02  U03  U04  U05  U06  U07  U08  U09  U10
0    0    0    0    0    0    0    0    0    0    0
1    0    0    0    0    0    0    0    0    0    0
2    0    1    1    1    0    0    0    0    0    0
3    0    1    1    1    0    0    0    0    0    0
4    1    1    1    1    0    0    0    0    0    0

In [14]:
M = U.mul(X['MIN_CHAR'], axis=0)
M.head()

   U01  U02  U03  U04  U05  U06  U07  U08  U09  U10
0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0
1  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0
2  0.0  1.0  1.0  1.0  0.0  0.0  0.0  0.0  0.0  0.0
3  0.0  1.0  1.0  1.0  0.0  0.0  0.0  0.0  0.0  0.0
4  1.0  1.0  1.0  1.0  0.0  0.0  0.0  0.0  0.0  0.0

In [15]:
A = M.mean(axis=0)
A

U01    0.127010
U02    0.299629
U03    0.296153
U04    0.289040
U05    0.000000
U06    0.000000
U07    0.000000
U08    0.000000
U09    0.000000
U10    0.000000
dtype: float64

In [16]:
SMS = 0.8
post = 15
x_sell_resp = 0.1
x_sell_resp_fup = 0.2
ann_premium = 10000
up_sell_resp = 0.3
up_sell_resp_fup = 0.5
single_premium = 100000
ret_resp = 0.5
ret_ann_premium = 10000
daily_rate = 6000
MD = 5 * 80
n = 0.1 * 383131

In [17]:
C1 = 0

In [18]:
C2 = ((n * ann_premium) * x_sell_resp_fup) - ((n * ann_premium) * (x_sell_resp + (x_sell_resp_fup - x_sell_resp) * A[0]))
C2

33446942.729318798

In [19]:
C3 = 0

In [20]:
C4 = 0

In [21]:
PC = MD * daily_rate
PC

2400000

In [22]:
TNQC = C1 + C2 + C3 + C4
TNQC

33446942.729318798

In [23]:
ROI = (TNQC - PC) / PC
ROI

12.936226137216165